In [ ]:
#School data
#Objectives:
#1. District Summary
#    Total Schools
#    Total Students
#    Total Budget
#    Average Math Score
#    Average Reading Score
#    % Passing Math (The percentage of students that passed math.)
#    % Passing Reading (The percentage of students that passed reading.)
#    % Overall Passing (The percentage of students that passed math and reading.)
#2. School Summary
#    School Name
#    School Type
#    Total Students
#    Total School Budget
#    Per Student Budget
#    Average Math Score
#    Average Reading Score
#    % Passing Math (The percentage of students that passed math.)
#    % Passing Reading (The percentage of students that passed reading.)
#    % Overall Passing (The percentage of students that passed math and reading.)
#3 Top 5 Performing Schools (By % Overall Passing)
#     School Name
#     School Type
#     Total Students
#     Total School Budget
#     Per Student Budget
#     Average Math Score
#     Average Reading Score
#     % Passing Math (The percentage of students that passed math.)
#     % Passing Reading (The percentage of students that passed reading.)
#     % Overall Passing (The percentage of students that passed math and reading.)
#4 Bottom 5 Performing Schools (By % Overall Passing)
#     Same metrics
#5 Math Scores by Grade**
#     Create a table that lists the average Math Score for students of each grade level (9th, 10th, 11th, 12th) at each school.
#6 Reading Scores by Grade
#     Create a table that lists the average Reading Score for students of each grade level (9th, 10th, 11th, 12th) at each school.
#7 Scores by School Spending
#     Create a table that breaks down school performances based on average Spending Ranges (Per Student). 
#     Use 4 reasonable bins to group school spending. Include in the table each of the following:
#         Average Math Score
#         Average Reading Score
#         % Passing Math (The percentage of students that passed math.)
#         % Passing Reading (The percentage of students that passed reading.)
#         % Overall Passing (The percentage of students that passed math and reading.)
#8 Scores by School Size
#     Repeat the above breakdown, but this time group schools based on a 
#     reasonable approximation of school size (Small, Medium, Large).
#9 Scores by School Type
#     Repeat the above breakdown, but this time group schools based on a 
#     reasonable approximation of school type (Charter vs. District).

In [6]:
#import pandas module
import pandas as pd
import os

#create path for files
csv1_path = os.path.join(".", "Resources", "schools_complete.csv")
csv2_path = os.path.join(".", "Resources", "students_complete.csv")
school_data = pd.read_csv(csv1_path)
student_data = pd.read_csv(csv2_path)

In [13]:
school_data.head()

       School ID         size        budget
count  15.000000    15.000000  1.500000e+01
mean    7.000000  2611.333333  1.643295e+06
std     4.472136  1420.915282  9.347763e+05
min     0.000000   427.000000  2.480870e+05
25%     3.500000  1698.000000  1.046265e+06
50%     7.000000  2283.000000  1.319574e+06
75%    10.500000  3474.000000  2.228999e+06
max    14.000000  4976.000000  3.124928e+06

In [12]:
student_data.head()

         Student ID  reading_score    math_score
count  39170.000000    39170.00000  39170.000000
mean   19584.500000       81.87784     78.985371
std    11307.549359       10.23958     12.309968
min        0.000000       63.00000     55.000000
25%     9792.250000       73.00000     69.000000
50%    19584.500000       82.00000     79.000000
75%    29376.750000       91.00000     89.000000
max    39169.000000       99.00000     99.000000

In [14]:
merged_df = pd.merge(student_data, school_data, on= "school_name")
merged_df

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [20]:
school_count = merged_df[school_name"].lens()
distr_average_math = merged_df["math_score"].mean()
distr_average_reading = merged_df["reading_score"].mean()
print(f"The District has {school_count} Schools")
print(f"District Average Math Score: {distr_average_math}")
print(f"District Average Reading Score: {distr_average_reading}")

NameError: name 'school_name' is not defined